namespace Test
{
    internal static class DataToTest
    {
        internal static string[][] InfoToCatalog()
        {
            string[][] data = new string[6][];

            data[0] = new string[]
            {
            "Мастер и Маргарита",
            "Михаил Булгаков",
            "Екатеринбург",
            "Москва",
            "1980",
            "310",
            "Роман в 32 главы",
            "9780141180144"
            };

            data[1] = new string[]
            {
            "Советский Спорт",
            "Москва",
            "Советский Спорт",
            "2013",
            "50",
            "Газета за 16 декабря, №189-М(19149)",
            "19149",
            "16.12.2013",
            "84025613"
            };

            data[2] = new string[]
            {
            "Способ запуска объекта с космодрома в космосе",
            "Ломанов А.А.",
            "Россия",
            "2241643-2002/1",
            "04.12.2000",
            "27.11.2002",
            "500",
            "Изобретение относится к области космической техники и, в частности, к средствам запуска космических объектов"
             };

            data[3] = new string[]
            {
            "Название книги",
            "Другой автор-1, Михаил Булгаков, Толстой",
            "Ижевск",
            "Московский вестник",
            "2000",
            "250",
            "Примечание для книги",
            "9780141180100"
             };

            data[4] = new string[]
            {
            "Спорт",
            "Санкт-Петербург",
            "Совет",
            "2000",
            "50",
            "Хорошая газета",
            "19111",
            "16.10.2007",
            "84025677"
            };

            data[5] = new string[]
            {
            "Патент",
            "Ломанов А.А., Еще один изобретатель",
            "Россия",
            "2241677-2012/4",
            "11.10.2001",
            "27.01.2002",
            "300",
            "Примечание к патерну за номером 2241677-2012/4"
            };

            return data;
        }
    }
}